uu0901/python-oled-gifdata/stm32f103re/myOled/Hardware/oled.c
	/*提取整数部分和小数部分*/
	IntNum = Number;						//直接赋值给整型变量，提取整数
	Number -= IntNum;						//将Number的整数减掉，防止之后将小数乘到整数时因数过大造成错误
	PowNum = OLED_Pow(10, FraLength);		//根据指定小数的位数，确定乘数
	FraNum = round(Number * PowNum);		//将小数乘到整数，同时四舍五入，避免显示误差
	IntNum += FraNum / PowNum;				//若四舍五入造成了进位，则需要再加给整数
	
	/*显示整数部分*/
	oledShowNum(X + FontSize, Y, IntNum, IntLength, FontSize);
	
	/*显示小数点*/
	oledShowChar(X + (IntLength + 1) * FontSize, Y, '.', FontSize);
	
	/*显示小数部分*/
	oledShowNum(X + (IntLength + 2) * FontSize, Y, FraNum, FraLength, FontSize);
}

/**
  * 函    数：OLED显示图像
  * 参    数：X 指定图像左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * 参    数：Y 指定图像左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * 参    数：Width 指定图像的宽度，范围：0~128
  * 参    数：Height 指定图像的高度，范围：0~64
  * 参    数：Image 指定要显示的图像
  * 返 回 值：无
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  */
//void oledShowImage(int16_t X, int16_t Y, uint8_t Width, uint8_t Height, const uint8_t *Image)
//{
//	int16_t i, j;
//	for (j = 0; j < Height; j++)
//	{
//		for (i = 0; i < Width; i++)
//		{
//			if (X + i >= 0 && X + i <= 127 && Y + j >= 0 && Y + j <= 63)
//			{
//				#ifdef OLED_ROW_MODE
//				// 逐行式：每字节 8 水平像素
//				if (Image[j * Width / 8 + i / 8] & (0x80 >> (i % 8)))
//				{
//					OLED_DisplayBuf[Y + j][(X + i) / 8] |= 0x80 >> ((X + i) % 8);
//				}
//				else
//				{
//					OLED_DisplayBuf[Y + j][(X + i) / 8] &= ~(0x80 >> ((X + i) % 8));
//				}
//				#else
//				// 页式：每字节 8 垂直像素
//				if (Image[(j / 8) * Width + i] & (0x01 << (j % 8)))
//				{
//					OLED_DisplayBuf[(Y + j) / 8][X + i] |= 0x01 << ((Y + j) % 8);
//				}
//				else
//				{
//					OLED_DisplayBuf[(Y + j) / 8][X + i] &= ~(0x01 << ((Y + j) % 8));
//				}
//				#endif
//			}
//		}
//	}
//}
void oledShowImage(int16_t x, int16_t y, uint8_t width, uint8_t height, const uint8_t *image)
{
    if (x < 0 || y < 0 || x + width > 128 || y + height > 64) {
        return; // 防止越界
    }

#ifdef OLED_ROW_MODE
    // 逐行模式：每字节 8 水平像素，LSB 左起
    uint8_t bytes_per_row = width / 8;
    for (uint8_t row = 0; row < height; row++)
    {
        for (uint8_t byte_idx = 0; byte_idx < bytes_per_row; byte_idx++)
        {
            uint8_t data = image[row * bytes_per_row + byte_idx];

            for (uint8_t bit = 0; bit < 8; bit++)
            {
                uint8_t pixel = (data >> bit) & 0x01; // LSB → MSB
                uint8_t col = x + byte_idx * 8 + bit;
                uint8_t line = y + row;

                if (pixel)
                    OLED_DisplayBuf[line][col / 8] |=  (0x80 >> (col % 8));
                else
                    OLED_DisplayBuf[line][col / 8] &= ~(0x80 >> (col % 8));
            }
        }
    }
#else
    // 页模式：每字节 8 垂直像素，bit0 顶部
    uint8_t pages = (height + 7) / 8;
    for (uint8_t page = 0; page < pages; page++)
    {
        for (uint8_t col = 0; col < width; col++)
        {
            uint8_t data = image[page * width + col];
            for (uint8_t bit = 0; bit < 8; bit++)
            {
                uint8_t pixel = (data >> bit) & 0x01; // bit0 顶部
                uint8_t yy = y + page * 8 + bit;
                if (yy >= y + height) break; // 防止超出范围

                if (pixel)
                    OLED_DisplayBuf[yy / 8][x + col] |=  (1 << (yy % 8));
                else
                    OLED_DisplayBuf[yy / 8][x + col] &= ~(1 << (yy % 8));
            }
        }
    }
#endif
}


void oledShowImageAddInvert(int16_t X, int16_t Y, uint8_t Width, uint8_t Height, const uint8_t *Image, uint8_t Invert)
{
    for (int16_t j = 0; j < Height; j++)
    {
        for (int16_t i = 0; i < Width; i++)
        {
            if (X + i >= 0 && X + i <= 127 && Y + j >= 0 && Y + j <= 63)
            {
#ifdef OLED_ROW_MODE
                // 逐行模式：LSB 左起
                uint8_t bit = (Image[j * Width / 8 + i / 8] & (0x01 << (i % 8))) ? 1 : 0;
                if (Invert) bit = !bit;

                if (bit)
                    OLED_DisplayBuf[Y + j][(X + i) / 8] |=  (0x80 >> ((X + i) % 8));
                else
                    OLED_DisplayBuf[Y + j][(X + i) / 8] &= ~(0x80 >> ((X + i) % 8));
#else
                // 页模式：bit0 顶部
                uint8_t bit = (Image[(j / 8) * Width + i] & (0x01 << (j % 8))) ? 1 : 0;
                if (Invert) bit = !bit;

                if (bit)
                    OLED_DisplayBuf[(Y + j) / 8][X + i] |=  (1 << ((Y + j) % 8));
                else
                    OLED_DisplayBuf[(Y + j) / 8][X + i] &= ~(1 << ((Y + j) % 8));
#endif
            }
        }
    }
}


/**
  * 函    数：OLED使用printf函数打印格式化字符串（支持ASCII码和中文混合写入）
  * 参    数：X 指定格式化字符串左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * 参    数：Y 指定格式化字符串左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * 参    数：FontSize 指定字体大小
  *           范围：OLED_8X16		宽8像素，高16像素
  *                 OLED_6X8		宽6像素，高8像素
  * 参    数：format 指定要显示的格式化字符串，范围：ASCII码可见字符或中文字符组成的字符串
  * 参    数：... 格式化字符串参数列表
  * 返 回 值：无
  * 说    明：显示的中文字符需要在OLED_Data.c里的OLED_CF16x16数组定义
  *           未找到指定中文字符时，会显示默认图形（一个方框，内部一个问号）
  *           当字体大小为OLED_8X16时，中文字符以16*16点阵正常显示
  *           当字体大小为OLED_6X8时，中文字符以6*8点阵显示'?'
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  */
void oledPrintf(int16_t X, int16_t Y, uint8_t FontSize, char *format, ...)
{
	char String[256];						//定义字符数组
	va_list arg;							//定义可变参数列表数据类型的变量arg
	va_start(arg, format);					//从format开始，接收参数列表到arg变量
	vsprintf(String, format, arg);			//使用vsprintf打印格式化字符串和参数列表到字符数组中
	va_end(arg);							//结束变量arg
	oledShowString(X, Y, String, FontSize);//OLED显示字符数组（字符串）
}

/**
  * 函    数：OLED在指定位置画一个点
  * 参    数：X 指定点的横坐标，范围：-32768~32767，屏幕区域：0~127
  * 参    数：Y 指定点的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * 返 回 值：无
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  */
void oledDrawPoint(int16_t X, int16_t Y)
{
	if (X >= 0 && X <= 127 && Y >=0 && Y <= 63)		//超出屏幕的内容不显示
	{
		/*将显存数组指定位置的一个Bit数据置1*/
//		OLED_DisplayBuf[Y / 8][X] |= 0x01 << (Y % 8);
		//OLED_DisplayBuf[Y][X / 8] |= 0x80 >> (X % 8);
		
#ifdef OLED_ROW_MODE
		OLED_DisplayBuf[Y][X / 8] |= 0x80 >> (X % 8);
#else
		OLED_DisplayBuf[Y / 8][X] |= 0x01 << (Y % 8);
#endif
	}
}

/**
  * 函    数：OLED获取指定位置点的值
  * 参    数：X 指定点的横坐标，范围：-32768~32767，屏幕区域：0~127
  * 参    数：Y 指定点的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * 返 回 值：指定位置点是否处于点亮状态，1：点亮，0：熄灭
  */
uint8_t oledGetPoint(int16_t X, int16_t Y)
{
	if (X >= 0 && X <= 127 && Y >=0 && Y <= 63)		//超出屏幕的内容不读取
	{
		/*判断指定位置的数据*/
//		if (OLED_DisplayBuf[Y / 8][X] & 0x01 << (Y % 8))
//		{
//			return 1;	//为1，返回1
//		}
#ifdef OLED_ROW_MODE
		return (OLED_DisplayBuf[Y][X / 8] & (0x80 >> (X % 8))) ? 1 : 0;
#else
		return (OLED_DisplayBuf[Y / 8][X] & (0x01 << (Y % 8))) ? 1 : 0;
#endif
		
